app/views/microposts/_micropost.html.erb

	<span class="timestamp">
		Posted <%= time_ago_in_words(micropost.created_at) %> ago.
		<% if current_user?(micropost.user) %>
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Sit et voluptas voluptates culpa iure enim omnis eos et."], ["user_id", 1], ["created_at", "2017-09-15 14:06:38.129053"], ["updated_at", "2017-09-15 14:06:38.129053"]]