app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "New plate for tea"], ["user_id", 1], ["created_at", "2017-09-18 15:07:18.439735"], ["updated_at", "2017-09-18 15:07:18.439735"], ["picture", "HTB15d7iNFXXXXb8XFXXq6xXFXXXB.jpg"]]
---
	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save