app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$/ZeeEqYl/zQju5i4dqgAg.Gt7.wArE420MEtDSmCsXXpJdTydw/jK"], ["updated_at", "2017-09-14 13:15:43.908306"], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?                # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)        # Case (4)